In [ ]:
# Selim GUL 9153220220
# Homework 3 - Foundations of Data Science

In [3]:
import pandas as pd

# Question 1

In [4]:
dataSet = {'age': [4,3,6,4,2,5],
 'Color': ["brown", "grey", "golden", "grey", "black", "brown"],
 'fur': ["shaggy", "short", "curly", "shaggy", "curly", "shaggy"],
 'name': ["odie", "gabe", "samosa", "gabe", "bob barker", "odie"]}
data = pd.DataFrame(dataSet, index= ["123", "456", "821", "198", "3", "42"])
data.index.names = ["dog_ID"]

In [5]:
data.head()

        age   Color     fur        name
dog_ID
123       4   brown  shaggy        odie
456       3    grey   short        gabe
821       6  golden   curly      samosa
198       4    grey  shaggy        gabe
3         2   black   curly  bob barker

# Question 2

In [6]:
print(data.age.max()) # shows the age of the oldest dog

6

# Question 3

In [7]:
most_common = data['fur'].value_counts().nlargest(1) # shows the number of dogs with each fur type
print(most_common)
dog_count = len(data.index)
print("The proportion is {}/{}".format(most_common[0], dog_count)) # shows the number of dogs in the data set

shaggy    3
Name: fur, dtype: int64
The proportion is 3/6

# Question 4

In [35]:
data.age.quantile([0.25])

0.25    3.25
Name: age, dtype: float64

# Question 5

In [24]:
employee_data = pd.read_excel("/Users/selimgul/Downloads/HR-Employee-Attrition.xlsx")
df1 = employee_data.iloc[0:5, 0:8]
df1.index.names = ["EmployeeNumber"]
df1['EmployeeNumber'] = [1, 2, 4, 5, 7]
df1.set_index('EmployeeNumber', inplace=True)
df1.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField
EmployeeNumber,,,,,,,,
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences
2,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences
4,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other
5,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences
7,27,No,Travel_Rarely,591,Research & Development,2,1,Medical

# Question 6

In [25]:
df1.loc[df1['Age'] == 41]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField
EmployeeNumber,,,,,,,,
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences

# Question 7

In [28]:
df1.sort_values(by=['Age'], ascending=False)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField
EmployeeNumber,,,,,,,,
2,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences
4,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other
5,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences
7,27,No,Travel_Rarely,591,Research & Development,2,1,Medical

# Question 8

In [29]:
df1['Attrition'].value_counts(normalize=True) * 100

No     60.0
Yes    40.0
Name: Attrition, dtype: float64

# Question 9

In [9]:
dataSet1 = {'key1': ["Ohio", "Nevada", "New York"], 'data': [2000, 2001, 2002]}
dataSet2 = {'key1': ["Nevada", "Ohio", "Iowa"], 'data2': [2001, 2000, 2003]}

data1 = pd.DataFrame(dataSet1)
data2 = pd.DataFrame(dataSet2)

data1.head()

       key1  data
0      Ohio  2000
1    Nevada  2001
2  New York  2002

In [10]:
data2.head()

     key1  data2
0  Nevada   2001
1    Ohio   2000
2    Iowa   2003

# Question 10

In [11]:
frames = [data1, data2]
pd.concat(frames)

       key1    data   data2
0      Ohio  2000.0     NaN
1    Nevada  2001.0     NaN
2  New York  2002.0     NaN
0    Nevada     NaN  2001.0
1      Ohio     NaN  2000.0
2      Iowa     NaN  2003.0

In [14]:
new_data= data1.merge(data2, how='outer', on='key1')
new_data.head()

       key1    data   data2
0      Ohio  2000.0  2000.0
1    Nevada  2001.0  2001.0
2  New York  2002.0     NaN
3      Iowa     NaN  2003.0